# 7
""" Создать (не программно) текстовый файл,
в котором каждая строка должна содержать данные о фирме:
название, форма собственности, выручка, издержки.
Пример строки файла: firm_1 ООО 10000 5000.
Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль.
Если фирма получила убытки, в расчет средней прибыли ее не включать.
Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями,
а также словарь со средней прибылью.
Если фирма получила убытки, также добавить ее в словарь (со значением убытков).
Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].
Итоговый список сохранить в виде json-объекта в соответствующий файл.
Пример json-объекта:
[{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]

Подсказка: использовать менеджеры контекста. """
#
import json
with open('task_7.txt', 'r') as f:
    average_profit = 0
    i = 0
    dict_firm = {}
    for line in f:
        profit = int(line.split()[-2]) - int(line.split()[-1])
        if profit > 0:
            average_profit += profit
            i += 1
        dict_firm[line.split()[0]] = profit
    dict_average = {'average_profit': round(average_profit / i, 2)}
    json_firm = [dict_firm, dict_average]
with open('task_7.json', 'w') as f_json:
    json.dump(json_firm, f_json)
